2021.11.16.org
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+HTML_HEAD: <style type="text/css">#table-of-contents h2 { display: none } .title { display: none } .authorname { text-align: right }</style>
#+HTML_HEAD: <style type="text/css">.outline-2 {border-top: 1px solid black;}</style>
#+TITLE: OCaml Weekly News
[[https://alan.petitepomme.net/cwn/2021.11.09.html][Previous Week]] [[https://alan.petitepomme.net/cwn/index.html][Up]] [[https://alan.petitepomme.net/cwn/2021.11.23.html][Next Week]]

Hello

Here is the latest OCaml Weekly News, for the week of November 09 to 16, 2021.

#+TOC: headlines 1


* Early preview of the Algorithmic with OCaml Book
:PROPERTIES:
:CUSTOM_ID: 1
:END:
Archive: https://discuss.ocaml.org/t/early-preview-of-the-algorithmic-with-ocaml-book/8785/1

** Damien Guichard announced


Please report bugs, bad English & nonsenses.
But do not report omissions (it is work-in-progress plus it's not an ocaml bible).

https://www.cjoint.com/c/KKjulI1Dx03

Why the book is not bottom up, instead some concepts are used without explained ?

- Because some notions (what is the ~unit~ type ? what is a queue ?) are considered easy-enough to go without saying.

What will be in the missing chapter 6 ?

- Type polymorphism, universal quantification, ~Stdlib.compare~, weak polymorphism, constrained polymorphism, phantom types, type variance.

What will be in the chapters 12 and more ?
- High performance lexing
- Recursive-descent parsing
- The art of searching
- Detailed construction of the ERic 0.3 application

Will the source files go to a repository ?

- No. The source files are already included in the zip archive.
      



* pyml_bindgen: a CLI app to generate Python bindings directly from OCaml value specifications
:PROPERTIES:
:CUSTOM_ID: 2
:END:
Archive: https://discuss.ocaml.org/t/ann-pyml-bindgen-a-cli-app-to-generate-python-bindings-directly-from-ocaml-value-specifications/8786/1

** Ryan Moore announced


I wanted to announce the first release of [[https://github.com/mooreryan/ocaml_python_bindgen][pyml_bindgen]], a CLI
app for generating Python bindings using [[https://github.com/thierry-martinez/pyml/][pyml]] directly from OCaml value
specifications.

Manually writing bindings to Python libraries can get tedious pretty quickly.  ~pyml_bindgen~ aims to help you avoid
a lot of the repetitive work when binding Python libraries by letting you focus on the OCaml side of things and
(mostly) not worrying about the implementation of the pyml bindings.

*** Quick start

First, install ~pyml_bindgen~.  It is available on [[https://opam.ocaml.org/packages/pyml_bindgen/][Opam]].

#+begin_example
$ opam install pyml_bindgen
#+end_example

Say you have a Python class you want to bind and use in OCaml.  (Filename: ~adder.py~)

#+begin_src python
class Adder:
    @staticmethod
    def add(x, y):
        return x + y
#+end_src

To do so, you write OCaml value specifications for the class and methods you want to bind.  (Filename:
~val_specs.txt~)

#+begin_src ocaml
val add : x:int -> y:int -> unit -> int
#+end_src

Then, you run ~pyml_bindgen~.

#+begin_example
$ pyml_bindgen val_specs.txt adder Adder --caml-module Adder > lib.ml
#+end_example

Now you can use your generated functions in your OCaml code.  (Filename: ~run.ml~)

#+begin_src ocaml
open Lib

let () = Py.initialize ()

let result = Adder.add ~x:1 ~y:2 ()

let () = assert (result = 3)
#+end_src

Finally, set up a dune file and run it.

#+begin_example
(executable
 (name run)
 (libraries pyml))
#+end_example

#+begin_example
$ dune exec ./run.exe
#+end_example

*** Documentation

For more information on installing and using ~pyml_bindgen~, check out the
[[https://mooreryan.github.io/ocaml_python_bindgen/][docs]].  There you will find lots of tips and examples to help you
get started!
      



