2021.11.16.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-16 Tue 09:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2021.11.09.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2021.11.23.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of November 09 to 16, 2021.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#1">Early preview of the Algorithmic with OCaml Book</a></li>
<li><a href="#2">pyml_bindgen: a CLI app to generate Python bindings directly from OCaml value specifications</a></li>
<li><a href="#3">ocaml-wayland (pure OCaml wayland protocol library)</a></li>
<li><a href="#4">Set up OCaml 2.0.0-beta6</a></li>
<li><a href="#5">Set up OCaml 2.0.0-beta7</a></li>
<li><a href="#6">Set up OCaml 2.0.0-beta8</a></li>
<li><a href="#7">phylogenetics, a library for molecular evolution</a></li>
<li><a href="#8">release of svmwrap: a wrapper around libsvm-tools</a></li>
<li><a href="#9">GeoPub - A XMPP web client</a></li>
<li><a href="#org983faf5">Old CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="1">Early preview of the Algorithmic with OCaml Book</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/early-preview-of-the-algorithmic-with-ocaml-book/8785/1">https://discuss.ocaml.org/t/early-preview-of-the-algorithmic-with-ocaml-book/8785/1</a>
</p>
</div>

<div id="outline-container-orge3c5477" class="outline-3">
<h3 id="orge3c5477">Damien Guichard announced</h3>
<div class="outline-text-3" id="text-orge3c5477">
<p>
Please report bugs, bad English &amp; nonsenses.
But do not report omissions (it is work-in-progress plus it's not an ocaml bible).
</p>

<p>
<a href="https://www.cjoint.com/c/KKjulI1Dx03">https://www.cjoint.com/c/KKjulI1Dx03</a>
</p>

<p>
Why the book is not bottom up, instead some concepts are used without explained ?
</p>

<ul class="org-ul">
<li>Because some notions (what is the <code>unit</code> type ? what is a queue ?) are considered easy-enough to go without saying.</li>
</ul>

<p>
What will be in the missing chapter 6 ?
</p>

<ul class="org-ul">
<li>Type polymorphism, universal quantification, <code>Stdlib.compare</code>, weak polymorphism, constrained polymorphism, phantom types, type variance.</li>
</ul>

<p>
What will be in the chapters 12 and more ?
</p>
<ul class="org-ul">
<li>High performance lexing</li>
<li>Recursive-descent parsing</li>
<li>The art of searching</li>
<li>Detailed construction of the ERic 0.3 application</li>
</ul>

<p>
Will the source files go to a repository ?
</p>

<ul class="org-ul">
<li>No. The source files are already included in the zip archive.</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-2" class="outline-2">
<h2 id="2">pyml_bindgen: a CLI app to generate Python bindings directly from OCaml value specifications</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-pyml-bindgen-a-cli-app-to-generate-python-bindings-directly-from-ocaml-value-specifications/8786/1">https://discuss.ocaml.org/t/ann-pyml-bindgen-a-cli-app-to-generate-python-bindings-directly-from-ocaml-value-specifications/8786/1</a>
</p>
</div>

<div id="outline-container-orgcbe9a4f" class="outline-3">
<h3 id="orgcbe9a4f">Ryan Moore announced</h3>
<div class="outline-text-3" id="text-orgcbe9a4f">
<p>
I wanted to announce the first release of <a href="https://github.com/mooreryan/ocaml_python_bindgen">pyml_bindgen</a>, a CLI
app for generating Python bindings using <a href="https://github.com/thierry-martinez/pyml/">pyml</a> directly from OCaml value
specifications.
</p>

<p>
Manually writing bindings to Python libraries can get tedious pretty quickly.  <code>pyml_bindgen</code> aims to help you avoid
a lot of the repetitive work when binding Python libraries by letting you focus on the OCaml side of things and
(mostly) not worrying about the implementation of the pyml bindings.
</p>
</div>

<div id="outline-container-orgadfd923" class="outline-4">
<h4 id="orgadfd923">Quick start</h4>
<div class="outline-text-4" id="text-orgadfd923">
<p>
First, install <code>pyml_bindgen</code>.  It is available on <a href="https://opam.ocaml.org/packages/pyml_bindgen/">Opam</a>.
</p>

<pre class="example" id="orgd82f976">
$ opam install pyml_bindgen
</pre>

<p>
Say you have a Python class you want to bind and use in OCaml.  (Filename: <code>adder.py</code>)
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Adder</span>:
    @<span style="color: #483d8b;">staticmethod</span>
    <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">add</span>(x, y):
        <span style="color: #a020f0;">return</span> x + y
</pre>
</div>

<p>
To do so, you write OCaml value specifications for the class and methods you want to bind.  (Filename:
<code>val_specs.txt</code>)
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">val</span> <span style="color: #0000ff;">add</span> : <span style="color: #008b8b;">x</span>:int -&gt; <span style="color: #008b8b;">y</span>:int -&gt; unit -&gt; int
</pre>
</div>

<p>
Then, you run <code>pyml_bindgen</code>.
</p>

<pre class="example" id="orgb923cff">
$ pyml_bindgen val_specs.txt adder Adder --caml-module Adder &gt; lib.ml
</pre>

<p>
Now you can use your generated functions in your OCaml code.  (Filename: <code>run.ml</code>)
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">open </span><span style="color: #228b22;">Lib</span>

<span style="color: #000000; font-weight: bold;">let</span> () = <span style="color: #228b22;">Py.</span>initialize ()

<span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a0522d;">result</span> = <span style="color: #228b22;">Adder.</span>add <span style="color: #008b8b;">~x</span>:1 <span style="color: #008b8b;">~y</span>:2 ()

<span style="color: #000000; font-weight: bold;">let</span> () = <span style="color: #a020f0;">assert</span> (result = 3)
</pre>
</div>

<p>
Finally, set up a dune file and run it.
</p>

<pre class="example" id="orgf3621e6">
(executable
 (name run)
 (libraries pyml))
</pre>

<pre class="example" id="org5131bfd">
$ dune exec ./run.exe
</pre>
</div>
</div>

<div id="outline-container-orgdebc2d1" class="outline-4">
<h4 id="orgdebc2d1">Documentation</h4>
<div class="outline-text-4" id="text-orgdebc2d1">
<p>
For more information on installing and using <code>pyml_bindgen</code>, check out the
<a href="https://mooreryan.github.io/ocaml_python_bindgen/">docs</a>.  There you will find lots of tips and examples to help you
get started!
</p>
</div>
</div>
</div>
</div>
