2021.11.16.org
* ocaml-wayland (pure OCaml wayland protocol library)
:PROPERTIES:
:CUSTOM_ID: 3
:END:
Archive: https://discuss.ocaml.org/t/ann-ocaml-wayland-pure-ocaml-wayland-protocol-library/7616/2

** Thomas Leonard announced


ocaml-wayland has been very stable over the last few months and so I've now released [[https://github.com/talex5/ocaml-wayland/releases/tag/v1.0][version 1.0]]. The main changes are improved error handling and
diagnostics.

I've been using this to write an Xwayland adaptor, which acts as an X11 window manager to Xwayland, converting
between the two protocols. This allows running X11 apps in VMs and having them appear alongside other application
windows on the host. It can also be used to fix other problems, such as support for HiDPI screens and Sway's buggy
clipboard support:

  https://roscidus.com/blog/blog/2021/10/30/xwayland/
      



* Set up OCaml 2.0.0-beta6
:PROPERTIES:
:CUSTOM_ID: 4
:END:
Archive: https://discuss.ocaml.org/t/ann-set-up-ocaml-2-0-0-beta6/8795/1

** Sora Morimoto announced


*** Changed

- Unlock opam 2.1 on the Ubuntu and macOS runners.

https://github.com/ocaml/setup-ocaml/releases/tag/v2.0.0-beta6
      



* Set up OCaml 2.0.0-beta7
:PROPERTIES:
:CUSTOM_ID: 5
:END:
Archive: https://discuss.ocaml.org/t/ann-set-up-ocaml-2-0-0-beta7/8796/1

** Sora Morimoto announced


*** Fixed

- Return an empty array to avoid depext failure when depext flags are not passed.

https://github.com/ocaml/setup-ocaml/releases/tag/v2.0.0-beta7
      



* Set up OCaml 2.0.0-beta8
:PROPERTIES:
:CUSTOM_ID: 6
:END:
Archive: https://discuss.ocaml.org/t/ann-set-up-ocaml-2-0-0-beta8/8821/1

** Sora Morimoto announced


*** Changed

- Use 2.1 mode instead of 2.0 mode on the Ubuntu and macOS runners.

https://github.com/ocaml/setup-ocaml/releases/tag/v2.0.0-beta8
      



* phylogenetics, a library for molecular evolution
:PROPERTIES:
:CUSTOM_ID: 7
:END:
Archive: https://discuss.ocaml.org/t/ann-phylogenetics-a-library-for-molecular-evolution/8812/1

** Philippe announced


I'm happy to announce the availability on opam of [[https://github.com/biocaml/phylogenetics][phylogenetics]], a
bioinformatics library dedicated to [[https://en.wikipedia.org/wiki/Molecular_evolution][molecular evolution]] and
phylogeny. It provides a few algorithms and data structures that can be useful to study how biological sequences like
proteins or genes have evolved, or to simulate datasets under various evolutionary models.

Comments/questions welcomed on the repo's issue tracker!
      



* release of svmwrap: a wrapper around libsvm-tools
:PROPERTIES:
:CUSTOM_ID: 8
:END:
Archive: https://discuss.ocaml.org/t/ann-release-of-svmwrap-a-wrapper-around-libsvm-tools/8818/1

