2021.11.16.html




<div id="outline-container-3" class="outline-2">
<h2 id="3">ocaml-wayland (pure OCaml wayland protocol library)</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-ocaml-wayland-pure-ocaml-wayland-protocol-library/7616/2">https://discuss.ocaml.org/t/ann-ocaml-wayland-pure-ocaml-wayland-protocol-library/7616/2</a>
</p>
</div>

<div id="outline-container-org4b63ad6" class="outline-3">
<h3 id="org4b63ad6">Thomas Leonard announced</h3>
<div class="outline-text-3" id="text-org4b63ad6">
<p>
ocaml-wayland has been very stable over the last few months and so I've now released <a href="https://github.com/talex5/ocaml-wayland/releases/tag/v1.0">version 1.0</a>. The main changes are improved error handling and
diagnostics.
</p>

<p>
I've been using this to write an Xwayland adaptor, which acts as an X11 window manager to Xwayland, converting
between the two protocols. This allows running X11 apps in VMs and having them appear alongside other application
windows on the host. It can also be used to fix other problems, such as support for HiDPI screens and Sway's buggy
clipboard support:
</p>

<p>
<a href="https://roscidus.com/blog/blog/2021/10/30/xwayland/">https://roscidus.com/blog/blog/2021/10/30/xwayland/</a>
</p>
</div>
</div>
</div>




<div id="outline-container-4" class="outline-2">
<h2 id="4">Set up OCaml 2.0.0-beta6</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-set-up-ocaml-2-0-0-beta6/8795/1">https://discuss.ocaml.org/t/ann-set-up-ocaml-2-0-0-beta6/8795/1</a>
</p>
</div>

<div id="outline-container-orgc179034" class="outline-3">
<h3 id="orgc179034">Sora Morimoto announced</h3>
<div class="outline-text-3" id="text-orgc179034">
</div>
<div id="outline-container-orga4f9d6f" class="outline-4">
<h4 id="orga4f9d6f">Changed</h4>
<div class="outline-text-4" id="text-orga4f9d6f">
<ul class="org-ul">
<li>Unlock opam 2.1 on the Ubuntu and macOS runners.</li>
</ul>

<p>
<a href="https://github.com/ocaml/setup-ocaml/releases/tag/v2.0.0-beta6">https://github.com/ocaml/setup-ocaml/releases/tag/v2.0.0-beta6</a>
</p>
</div>
</div>
</div>
</div>




<div id="outline-container-5" class="outline-2">
<h2 id="5">Set up OCaml 2.0.0-beta7</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-set-up-ocaml-2-0-0-beta7/8796/1">https://discuss.ocaml.org/t/ann-set-up-ocaml-2-0-0-beta7/8796/1</a>
</p>
</div>

<div id="outline-container-orga2e809f" class="outline-3">
<h3 id="orga2e809f">Sora Morimoto announced</h3>
<div class="outline-text-3" id="text-orga2e809f">
</div>
<div id="outline-container-org5794feb" class="outline-4">
<h4 id="org5794feb">Fixed</h4>
<div class="outline-text-4" id="text-org5794feb">
<ul class="org-ul">
<li>Return an empty array to avoid depext failure when depext flags are not passed.</li>
</ul>

<p>
<a href="https://github.com/ocaml/setup-ocaml/releases/tag/v2.0.0-beta7">https://github.com/ocaml/setup-ocaml/releases/tag/v2.0.0-beta7</a>
</p>
</div>
</div>
</div>
</div>




<div id="outline-container-6" class="outline-2">
<h2 id="6">Set up OCaml 2.0.0-beta8</h2>
<div class="outline-text-2" id="text-6">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-set-up-ocaml-2-0-0-beta8/8821/1">https://discuss.ocaml.org/t/ann-set-up-ocaml-2-0-0-beta8/8821/1</a>
</p>
</div>

<div id="outline-container-org71f2ef5" class="outline-3">
<h3 id="org71f2ef5">Sora Morimoto announced</h3>
<div class="outline-text-3" id="text-org71f2ef5">
</div>
<div id="outline-container-org9c5e7d2" class="outline-4">
<h4 id="org9c5e7d2">Changed</h4>
<div class="outline-text-4" id="text-org9c5e7d2">
<ul class="org-ul">
<li>Use 2.1 mode instead of 2.0 mode on the Ubuntu and macOS runners.</li>
</ul>

<p>
<a href="https://github.com/ocaml/setup-ocaml/releases/tag/v2.0.0-beta8">https://github.com/ocaml/setup-ocaml/releases/tag/v2.0.0-beta8</a>
</p>
</div>
</div>
</div>
</div>




<div id="outline-container-7" class="outline-2">
<h2 id="7">phylogenetics, a library for molecular evolution</h2>
<div class="outline-text-2" id="text-7">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-phylogenetics-a-library-for-molecular-evolution/8812/1">https://discuss.ocaml.org/t/ann-phylogenetics-a-library-for-molecular-evolution/8812/1</a>
</p>
</div>

<div id="outline-container-org381afa9" class="outline-3">
<h3 id="org381afa9">Philippe announced</h3>
<div class="outline-text-3" id="text-org381afa9">
<p>
I'm happy to announce the availability on opam of <a href="https://github.com/biocaml/phylogenetics">phylogenetics</a>, a
bioinformatics library dedicated to <a href="https://en.wikipedia.org/wiki/Molecular_evolution">molecular evolution</a> and
phylogeny. It provides a few algorithms and data structures that can be useful to study how biological sequences like
proteins or genes have evolved, or to simulate datasets under various evolutionary models.
</p>

<p>
Comments/questions welcomed on the repo's issue tracker!
</p>
</div>
</div>
</div>




<div id="outline-container-8" class="outline-2">
<h2 id="8">release of svmwrap: a wrapper around libsvm-tools</h2>
<div class="outline-text-2" id="text-8">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-release-of-svmwrap-a-wrapper-around-libsvm-tools/8818/1">https://discuss.ocaml.org/t/ann-release-of-svmwrap-a-wrapper-around-libsvm-tools/8818/1</a>
</p>
</div>
