2021.11.16.org
** UnixJunkie announced


I am pleased to announce the availability in opam of the svmwrap package.
A wrapper around libsvm's svm-train and svm-predict executables.
Currently, only regression modeling is supported, using the linear, RBF, sigmoid or polynomial kernel.

https://github.com/UnixJunkie/svmwrap

The quite scary usage looks like this:
#+begin_example
usage: svmwrap
  -i <filename>: training set or DB to screen
  --feats <int>: number of features
  [-o <filename>]: predictions output file
  [-np <int>]: ncores
  [--kernel <string>] choose kernel type {Lin|RBF|Sig|Pol}
  [-c <float>]: fix C
  [-e <float>]: epsilon in the loss function of epsilon-SVR;
  (0 <= epsilon <= max_i(|y_i|))
  [-g <float>]: fix gamma (for RBF and Sig kernels)
  [-r <float>]: fix r for the Sig kernel
  [--iwn]: turn ON instance-wise-normalization
  [--scale]: turn ON [0:1] scaling (NOT PRODUCTION READY)
  [--no-plot]: no gnuplot
  [{-n|--NxCV} <int>]: folds of cross validation
  [-q]: quiet
  [-v|--verbose]: equivalent to not specifying -q
  [--seed <int>]: fix random seed
  [-p <float>]: training set portion (in [0.0:1.0])
  [--pairs]: read from .AP files (atom pairs; will offset feat. indexes by 1)
  [--train <train.liblin>]: training set (overrides -p)
  [--valid <valid.liblin>]: validation set (overrides -p)
  [--test <test.liblin>]: test set (overrides -p)
  [{-l|--load} <filename>]: prod. mode; use trained models
  [{-s|--save} <filename>]: train. mode; save trained models
  [-f]: force overwriting existing model file
  [--scan-c]: scan for best C
  [--scan-e <int>]: epsilon scan #steps for SVR
  [--scan-g]: scan for best gamma
  [--regr]: regression (SVR); also, implied by -e and --scan-e
  [--e-range <float>:<int>:<float>]: specific range for e
  (semantic=start:nsteps:stop)
  [--c-range <float,float,...>] explicit scan range for C
  (example='0.01,0.02,0.03')
  [--g-range <float,float,...>] explicit range for gamma
  (example='0.01,0.02,0.03')
  [--r-range <float,float,...>] explicit range for r
  (example='0.01,0.02,0.03')
#+end_example

For people who know my linwrap opam package (a wrapper around liblinear tools), this is quite similar.
https://github.com/UnixJunkie/linwrap
      



* GeoPub - A XMPP web client
:PROPERTIES:
:CUSTOM_ID: 9
:END:
Archive: https://discuss.ocaml.org/t/ann-geopub-a-xmpp-web-client/8819/1

** pukkamustard announced


I'd like to announce an initial, proof-of-concept release of GeoPub - an XMPP web client. Unlike many XMPP clients
the focus is not on instant messaging but on creating, displaying and managing things such as events, maps,
information on local organizations and other local knowledge (see [[https://openengiadina.net][the openEngiadina]]
project for the context).

This initial release is not really anything useful but a proof-of-concept how such an application can be developed
using XMPP and OCaml. There are many rough edges and broken hacks that need fixing. I'd be very grateful for your
feedback, thoughts and ideas.

The source code of the app is on [[https://codeberg.org/openEngiadina/geopub][codeberg]] and a pre-built hosted version
is available [[https://geopub.openengiadina.net/][here]].

The application consists of some parts and ideas that I'd like to illustrate separately:

*** ocaml-xmpp

[[https://codeberg.org/openEngiadina/ocaml-xmpp][ocaml-xmpp]] is a XMPP client library for OCaml (documentation
available [[https://inqlab.net/projects/ocaml-xmpp/][online]].

**** Reactive
ocaml-xmpp is reactive in the sense that the XMPP connection is abstracted as a React event of Stanzas (small pieces
of information that flow over XMPP):

#+begin_src ocaml
val stanzas : t -> Stanza.t React.event
#+end_src

This React event can be filtered for messages in a specific conversation, for example.

