2021.11.16.html

<div id="outline-container-org8bf171a" class="outline-3">
<h3 id="org8bf171a">UnixJunkie announced</h3>
<div class="outline-text-3" id="text-org8bf171a">
<p>
I am pleased to announce the availability in opam of the svmwrap package.
A wrapper around libsvm's svm-train and svm-predict executables.
Currently, only regression modeling is supported, using the linear, RBF, sigmoid or polynomial kernel.
</p>

<p>
<a href="https://github.com/UnixJunkie/svmwrap">https://github.com/UnixJunkie/svmwrap</a>
</p>

<p>
The quite scary usage looks like this:
</p>
<pre class="example" id="org5e59f2b">
usage: svmwrap
  -i &lt;filename&gt;: training set or DB to screen
  --feats &lt;int&gt;: number of features
  [-o &lt;filename&gt;]: predictions output file
  [-np &lt;int&gt;]: ncores
  [--kernel &lt;string&gt;] choose kernel type {Lin|RBF|Sig|Pol}
  [-c &lt;float&gt;]: fix C
  [-e &lt;float&gt;]: epsilon in the loss function of epsilon-SVR;
  (0 &lt;= epsilon &lt;= max_i(|y_i|))
  [-g &lt;float&gt;]: fix gamma (for RBF and Sig kernels)
  [-r &lt;float&gt;]: fix r for the Sig kernel
  [--iwn]: turn ON instance-wise-normalization
  [--scale]: turn ON [0:1] scaling (NOT PRODUCTION READY)
  [--no-plot]: no gnuplot
  [{-n|--NxCV} &lt;int&gt;]: folds of cross validation
  [-q]: quiet
  [-v|--verbose]: equivalent to not specifying -q
  [--seed &lt;int&gt;]: fix random seed
  [-p &lt;float&gt;]: training set portion (in [0.0:1.0])
  [--pairs]: read from .AP files (atom pairs; will offset feat. indexes by 1)
  [--train &lt;train.liblin&gt;]: training set (overrides -p)
  [--valid &lt;valid.liblin&gt;]: validation set (overrides -p)
  [--test &lt;test.liblin&gt;]: test set (overrides -p)
  [{-l|--load} &lt;filename&gt;]: prod. mode; use trained models
  [{-s|--save} &lt;filename&gt;]: train. mode; save trained models
  [-f]: force overwriting existing model file
  [--scan-c]: scan for best C
  [--scan-e &lt;int&gt;]: epsilon scan #steps for SVR
  [--scan-g]: scan for best gamma
  [--regr]: regression (SVR); also, implied by -e and --scan-e
  [--e-range &lt;float&gt;:&lt;int&gt;:&lt;float&gt;]: specific range for e
  (semantic=start:nsteps:stop)
  [--c-range &lt;float,float,...&gt;] explicit scan range for C
  (example='0.01,0.02,0.03')
  [--g-range &lt;float,float,...&gt;] explicit range for gamma
  (example='0.01,0.02,0.03')
  [--r-range &lt;float,float,...&gt;] explicit range for r
  (example='0.01,0.02,0.03')
</pre>

<p>
For people who know my linwrap opam package (a wrapper around liblinear tools), this is quite similar.
<a href="https://github.com/UnixJunkie/linwrap">https://github.com/UnixJunkie/linwrap</a>
</p>
</div>
</div>
</div>




<div id="outline-container-9" class="outline-2">
<h2 id="9">GeoPub - A XMPP web client</h2>
<div class="outline-text-2" id="text-9">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-geopub-a-xmpp-web-client/8819/1">https://discuss.ocaml.org/t/ann-geopub-a-xmpp-web-client/8819/1</a>
</p>
</div>

<div id="outline-container-org67ec6f8" class="outline-3">
<h3 id="org67ec6f8">pukkamustard announced</h3>
<div class="outline-text-3" id="text-org67ec6f8">
<p>
I'd like to announce an initial, proof-of-concept release of GeoPub - an XMPP web client. Unlike many XMPP clients
the focus is not on instant messaging but on creating, displaying and managing things such as events, maps,
information on local organizations and other local knowledge (see <a href="https://openengiadina.net">the openEngiadina</a>
project for the context).
</p>

<p>
This initial release is not really anything useful but a proof-of-concept how such an application can be developed
using XMPP and OCaml. There are many rough edges and broken hacks that need fixing. I'd be very grateful for your
feedback, thoughts and ideas.
</p>

<p>
The source code of the app is on <a href="https://codeberg.org/openEngiadina/geopub">codeberg</a> and a pre-built hosted version
is available <a href="https://geopub.openengiadina.net/">here</a>.
</p>

<p>
The application consists of some parts and ideas that I'd like to illustrate separately:
</p>
</div>

<div id="outline-container-org7b66443" class="outline-4">
<h4 id="org7b66443">ocaml-xmpp</h4>
<div class="outline-text-4" id="text-org7b66443">
<p>
<a href="https://codeberg.org/openEngiadina/ocaml-xmpp">ocaml-xmpp</a> is a XMPP client library for OCaml (documentation
available <a href="https://inqlab.net/projects/ocaml-xmpp/">online</a>.
</p>
</div>

<div id="outline-container-orgb27485d" class="outline-5">
<h5 id="orgb27485d">Reactive</h5>
<div class="outline-text-5" id="text-orgb27485d">
<p>
ocaml-xmpp is reactive in the sense that the XMPP connection is abstracted as a React event of Stanzas (small pieces
of information that flow over XMPP):
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">val</span> <span style="color: #0000ff;">stanzas</span> : t -&gt; <span style="color: #228b22;">Stanza.</span>t <span style="color: #228b22;">React.</span>event
</pre>
</div>

<p>
This React event can be filtered for messages in a specific conversation, for example.
</p>
</div>
</div>
