2021.11.16.org
**** Transports

XMPP works with different transport mechanisms and ocaml-xmpp supports this. Currently ocaml-xmpp can be used from
Unix with a TCP/SSL connection to a XMPP server and from web browsers with a WebSocket connection. This is
implemented by abstracting the XMPP transport:

#+begin_src ocaml
module type TRANSPORT = sig
  (** {2 Connection} *)

  type options
  (** Additional options that may be passed to the transport *)

  type t
  (** Type of an instantiated connection to an XMPP server *)

  val connect : host:string -> options -> t Lwt.t

  val close : t -> unit Lwt.t

  val closed : t -> unit Lwt.t

  (** {2 XML Stream} *)

  type stream

  val open_stream : t -> to':string -> stream Lwt.t

  val stream_id : stream -> string Lwt.t

  val send_xml : stream -> Xmlc.t -> unit Lwt.t

  val signals : stream -> Xmlc.signal Lwt_stream.t

  val stop_stream : stream -> unit Lwt.t
end
#+end_src

A transport establishes the underlying connection to a server and can create XML streams (in XMPP a connection is by
multiple XML streams sequentially). For technical reasons XML parsing is also handled by the transport and a stream
of XML signals (element start, data, element end) is returned. This is due to the fact that XML parsing in XMPP needs
to be done slightly differently when using TCP (a single XML document over the entire stream) or WebSockets (every
WebSocket frame is a parse-able XML document).

The Unix/TCP/SSL transport uses Markup.ml and whereas the WebSocket transport uses Xmlm (and Brrr).

**** Parser combinators for XML

For parsing streams of XML signals to OCaml types ocaml-xmpp contains a parser combinator helper library:
[[https://inqlab.net/projects/ocaml-xmpp/xmlc/Xmlc/index.html][Xmlc]]. This allows parser for XML such as this:

#+begin_src xml
<bind xmlns='urn:ietf:params:xml:ns:xmpp-bind'><jid>w4iu4ckn3kjbqvcd@demo.openengiadina.net/z8Pkzfa8</jid></bind>
#+end_src

to be parses like this:

#+begin_src ocaml
Xmlc.Parser.(
  element (Ns.bind "bind") (fun _ ->
    element (Ns.bind "jid") (fun _ ->
      text >>| String.concat "" >>= fun jid_s ->
      match Jid.of_string jid_s with
      | Some jid -> return jid
      | None -> fail_with "invalid JID")))
#+end_src

**** XMPP extensions

Inspiration for the scope of the core library is taken from the [[http://strophe.im/][Strophe]] XMPP libraries -
everything that does not have directly to do with XMPP transport, authentication or stream management is kept outside
of the core library.

There are already some "extension" libraries outside of the core for useful XMPP features (e.g. [[https://inqlab.net/projects/ocaml-xmpp/xmpp/Xmpp_roster/index.html][Roster
management]],
[[https://inqlab.net/projects/ocaml-xmpp/xmpp/Xmpp_pubsub/index.html][PubSub]] and
[[https://inqlab.net/projects/ocaml-xmpp/xmpp/Xmpp_ping/index.html][pinging]]).

One thing that I do want to add to the core library is stream management according to
[[https://xmpp.org/extensions/xep-0198.html][XEP-0198]]. I expect this addition to change the core library API - the
API is not stable yet!

Much inspiration was taken from [[https://github.com/hannesm/jackline][Jackline]] - an OCaml XMPP client - and in
particular [[https://hannes.nqsb.io/Posts/Jackline][this post]] on Jackline. Many thanks to @hannes.

