2021.11.16.html

<div id="outline-container-orgd5678e0" class="outline-5">
<h5 id="orgd5678e0">Transports</h5>
<div class="outline-text-5" id="text-orgd5678e0">
<p>
XMPP works with different transport mechanisms and ocaml-xmpp supports this. Currently ocaml-xmpp can be used from
Unix with a TCP/SSL connection to a XMPP server and from web browsers with a WebSocket connection. This is
implemented by abstracting the XMPP transport:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">module type</span> <span style="color: #228b22;">TRANSPORT</span> = <span style="color: #000000; font-weight: bold;">sig</span>
  <span style="color: #8b2252;">(** {2 Connection} *)</span>

  <span style="color: #000000; font-weight: bold;">type</span> <span style="color: #228b22;">options</span>
  <span style="color: #8b2252;">(** Additional options that may be passed to the transport *)</span>

  <span style="color: #000000; font-weight: bold;">type</span> <span style="color: #228b22;">t</span>
  <span style="color: #8b2252;">(** Type of an instantiated connection to an XMPP server *)</span>

  <span style="color: #000000; font-weight: bold;">val</span> <span style="color: #0000ff;">connect</span> : <span style="color: #008b8b;">host</span>:string -&gt; options -&gt; t <span style="color: #228b22;">Lwt.</span>t

  <span style="color: #000000; font-weight: bold;">val</span> <span style="color: #0000ff;">close</span> : t -&gt; unit <span style="color: #228b22;">Lwt.</span>t

  <span style="color: #000000; font-weight: bold;">val</span> <span style="color: #0000ff;">closed</span> : t -&gt; unit <span style="color: #228b22;">Lwt.</span>t

  <span style="color: #8b2252;">(** {2 XML Stream} *)</span>

  <span style="color: #000000; font-weight: bold;">type</span> <span style="color: #228b22;">stream</span>

  <span style="color: #000000; font-weight: bold;">val</span> <span style="color: #0000ff;">open_stream</span> : t -&gt; <span style="color: #008b8b;">to'</span>:string -&gt; stream <span style="color: #228b22;">Lwt.</span>t

  <span style="color: #000000; font-weight: bold;">val</span> <span style="color: #0000ff;">stream_id</span> : stream -&gt; string <span style="color: #228b22;">Lwt.</span>t

  <span style="color: #000000; font-weight: bold;">val</span> <span style="color: #0000ff;">send_xml</span> : stream -&gt; <span style="color: #228b22;">Xmlc.</span>t -&gt; unit <span style="color: #228b22;">Lwt.</span>t

  <span style="color: #000000; font-weight: bold;">val</span> <span style="color: #0000ff;">signals</span> : stream -&gt; <span style="color: #228b22;">Xmlc.</span>signal <span style="color: #228b22;">Lwt_stream.</span>t

  <span style="color: #000000; font-weight: bold;">val</span> <span style="color: #0000ff;">stop_stream</span> : stream -&gt; unit <span style="color: #228b22;">Lwt.</span>t
<span style="color: #000000; font-weight: bold;">end</span>
</pre>
</div>

<p>
A transport establishes the underlying connection to a server and can create XML streams (in XMPP a connection is by
multiple XML streams sequentially). For technical reasons XML parsing is also handled by the transport and a stream
of XML signals (element start, data, element end) is returned. This is due to the fact that XML parsing in XMPP needs
to be done slightly differently when using TCP (a single XML document over the entire stream) or WebSockets (every
WebSocket frame is a parse-able XML document).
</p>

<p>
The Unix/TCP/SSL transport uses Markup.ml and whereas the WebSocket transport uses Xmlm (and Brrr).
</p>
</div>
</div>

<div id="outline-container-orgbe16dba" class="outline-5">
<h5 id="orgbe16dba">Parser combinators for XML</h5>
<div class="outline-text-5" id="text-orgbe16dba">
<p>
For parsing streams of XML signals to OCaml types ocaml-xmpp contains a parser combinator helper library:
<a href="https://inqlab.net/projects/ocaml-xmpp/xmlc/Xmlc/index.html">Xmlc</a>. This allows parser for XML such as this:
</p>

<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #0000ff;">bind</span> <span style="color: #483d8b;">xmlns</span>=<span style="color: #8b2252;">'urn:ietf:params:xml:ns:xmpp-bind'</span>&gt;&lt;<span style="color: #0000ff;">jid</span>&gt;w4iu4ckn3kjbqvcd@demo.openengiadina.net/z8Pkzfa8&lt;/<span style="color: #0000ff;">jid</span>&gt;&lt;/<span style="color: #0000ff;">bind</span>&gt;
</pre>
</div>

<p>
to be parses like this:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #228b22;">Xmlc.Parser.</span>(
  element (<span style="color: #228b22;">Ns.</span>bind <span style="color: #8b2252;">"bind"</span>) (<span style="color: #a020f0;">fun</span> <span style="color: #a0522d;">_</span> -&gt;
    element (<span style="color: #228b22;">Ns.</span>bind <span style="color: #8b2252;">"jid"</span>) (<span style="color: #a020f0;">fun</span> <span style="color: #a0522d;">_</span> -&gt;
      text &gt;&gt;| <span style="color: #228b22;">String.</span>concat <span style="color: #8b2252;">""</span> &gt;&gt;= <span style="color: #a020f0;">fun</span> <span style="color: #a0522d;">jid_s</span> -&gt;
      <span style="color: #a020f0;">match</span> <span style="color: #228b22;">Jid.</span>of_string jid_s <span style="color: #a020f0;">with</span>
      | <span style="color: #000000; background-color: #ffffff;">Some</span> jid -&gt; return jid
      | <span style="color: #000000; background-color: #ffffff;">None</span> -&gt; fail_with <span style="color: #8b2252;">"invalid JID"</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc506695" class="outline-5">
<h5 id="orgc506695">XMPP extensions</h5>
<div class="outline-text-5" id="text-orgc506695">
<p>
Inspiration for the scope of the core library is taken from the <a href="http://strophe.im/">Strophe</a> XMPP libraries -
everything that does not have directly to do with XMPP transport, authentication or stream management is kept outside
of the core library.
</p>

<p>
There are already some "extension" libraries outside of the core for useful XMPP features (e.g. <a href="https://inqlab.net/projects/ocaml-xmpp/xmpp/Xmpp_roster/index.html">Roster
management</a>,
<a href="https://inqlab.net/projects/ocaml-xmpp/xmpp/Xmpp_pubsub/index.html">PubSub</a> and
<a href="https://inqlab.net/projects/ocaml-xmpp/xmpp/Xmpp_ping/index.html">pinging</a>).
</p>

<p>
One thing that I do want to add to the core library is stream management according to
<a href="https://xmpp.org/extensions/xep-0198.html">XEP-0198</a>. I expect this addition to change the core library API - the
API is not stable yet!
</p>

<p>
Much inspiration was taken from <a href="https://github.com/hannesm/jackline">Jackline</a> - an OCaml XMPP client - and in
particular <a href="https://hannes.nqsb.io/Posts/Jackline">this post</a> on Jackline. Many thanks to @hannes.
</p>
</div>
</div>
</div>
