2021.11.16.org
*** reactor

GeoPub uses Brr. I had some trouble figuring out a suitable "architecture" for managing complex logic and ended up
hacking an [[https://elm-lang.org/][Elm]] inspired helper library:
[[https://codeberg.org/openEngiadina/geopub/src/branch/main/src/reactor/reactor.mli][reactor.mli]]. State updates for
the entire application are then handled in a single [[https://codeberg.org/openEngiadina/geopub/src/branch/main/src/geopub/main.ml#L28][update
function]].

I'm not yet very happy with this machinery and I'm pretty sure I'm using react in wrong and dangerous ways. I'd be
very grateful for ideas on how to improve this. THis might be related to this discussion:
https://discuss.ocaml.org/t/structuring-frp-specifically-note-applications/8645/17.

The reason for using React over Note is because ocaml-xmpp uses a lot of Lwt and ~Lwt_react~ provides nice bindings
for working with both. I guess something similar could be created for Note (e.g. ~Lwt_note~) and I'm open to using
Note (also in ocaml-xmpp).

*** Leaflet

GeoPub displays a map using the [[https://leafletjs.com/][Leaflet.js]] JavaScript library. GeoPub contains OCaml
bindings to Leaflet using Brr:
[[https://codeberg.org/openEngiadina/geopub/src/branch/main/src/leaflet/leaflet.mli][leaflet.mli]]. Writing this was
very straightforward and pleasant (I like Brr!).

One issue I have is that the Leaflet map needs to be manipulated very imperatively, whereas the rest of the
application is much more functional. This causes some mismatches. I guess one needs to find a way of hiding the
impressiveness of Leaflet (e.g. like [[https://github.com/PaulLeCam/react-leaflet][react-leaflet]]).

*** Guix for build and development environments

I use [[https://guix.gnu.org/][Guix]] for providing a build and development environment. With guix installed one can
run ~guix shell~ in the GeoPub repository to get a reproducible build environment. All dependencies are fetched and
made available by Guix in this environment (e.g. ~ocaml-xmpp~ or the OCaml compiler).

I will publish ~ocaml-xmpp~ on OPAM once the API is more stable and an initial release can be made.
      



* Old CWN
:PROPERTIES:
:UNNUMBERED: t
:END:

If you happen to miss a CWN, you can [[mailto:alan.schmitt@polytechnique.org][send me a message]] and I'll mail it to you, or go take a look at [[https://alan.petitepomme.net/cwn/][the archive]] or the [[https://alan.petitepomme.net/cwn/cwn.rss][RSS feed of the archives]].

If you also wish to receive it every week by mail, you may subscribe [[http://lists.idyll.org/listinfo/caml-news-weekly/][online]].

#+BEGIN_authorname
[[https://alan.petitepomme.net/][Alan Schmitt]]
#+END_authorname
