2021.11.16.html

<div id="outline-container-org01262af" class="outline-4">
<h4 id="org01262af">reactor</h4>
<div class="outline-text-4" id="text-org01262af">
<p>
GeoPub uses Brr. I had some trouble figuring out a suitable "architecture" for managing complex logic and ended up
hacking an <a href="https://elm-lang.org/">Elm</a> inspired helper library:
<a href="https://codeberg.org/openEngiadina/geopub/src/branch/main/src/reactor/reactor.mli">reactor.mli</a>. State updates for
the entire application are then handled in a single <a href="https://codeberg.org/openEngiadina/geopub/src/branch/main/src/geopub/main.ml#L28">update
function</a>.
</p>

<p>
I'm not yet very happy with this machinery and I'm pretty sure I'm using react in wrong and dangerous ways. I'd be
very grateful for ideas on how to improve this. THis might be related to this discussion:
<a href="https://discuss.ocaml.org/t/structuring-frp-specifically-note-applications/8645/17">https://discuss.ocaml.org/t/structuring-frp-specifically-note-applications/8645/17</a>.
</p>

<p>
The reason for using React over Note is because ocaml-xmpp uses a lot of Lwt and <code>Lwt_react</code> provides nice bindings
for working with both. I guess something similar could be created for Note (e.g. <code>Lwt_note</code>) and I'm open to using
Note (also in ocaml-xmpp).
</p>
</div>
</div>

<div id="outline-container-org31993b2" class="outline-4">
<h4 id="org31993b2">Leaflet</h4>
<div class="outline-text-4" id="text-org31993b2">
<p>
GeoPub displays a map using the <a href="https://leafletjs.com/">Leaflet.js</a> JavaScript library. GeoPub contains OCaml
bindings to Leaflet using Brr:
<a href="https://codeberg.org/openEngiadina/geopub/src/branch/main/src/leaflet/leaflet.mli">leaflet.mli</a>. Writing this was
very straightforward and pleasant (I like Brr!).
</p>

<p>
One issue I have is that the Leaflet map needs to be manipulated very imperatively, whereas the rest of the
application is much more functional. This causes some mismatches. I guess one needs to find a way of hiding the
impressiveness of Leaflet (e.g. like <a href="https://github.com/PaulLeCam/react-leaflet">react-leaflet</a>).
</p>
</div>
</div>

<div id="outline-container-orgfb3c8a1" class="outline-4">
<h4 id="orgfb3c8a1">Guix for build and development environments</h4>
<div class="outline-text-4" id="text-orgfb3c8a1">
<p>
I use <a href="https://guix.gnu.org/">Guix</a> for providing a build and development environment. With guix installed one can
run <code>guix shell</code> in the GeoPub repository to get a reproducible build environment. All dependencies are fetched and
made available by Guix in this environment (e.g. <code>ocaml-xmpp</code> or the OCaml compiler).
</p>

<p>
I will publish <code>ocaml-xmpp</code> on OPAM once the API is more stable and an initial release can be made.
</p>
</div>
</div>
</div>
</div>




<div id="outline-container-org983faf5" class="outline-2">
<h2 id="org983faf5">Old CWN</h2>
<div class="outline-text-2" id="text-org983faf5">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe <a href="http://lists.idyll.org/listinfo/caml-news-weekly/">online</a>.
</p>

<div class="authorname" id="org74a0dfd">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
